; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-2-7-193)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p4-0 - location
	p4-1 - location
	p2-0 - location
	p2-4 - location
	p3-0 - location
	p3-4 - location
	p0-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s2)
	(at driver4 s4)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s2)
	(at package2 s1)
	(at package3 s2)
	(at package4 s2)
	(at package5 s4)
	(at package6 s3)
	(at package7 s0)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 19)
	(= (time-to-walk p4-0 s4) 19)
	(= (time-to-walk s0 p4-0) 22)
	(= (time-to-walk p4-0 s0) 22)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 30)
	(= (time-to-walk p4-1 s4) 30)
	(= (time-to-walk s1 p4-1) 2)
	(= (time-to-walk p4-1 s1) 2)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 35)
	(= (time-to-walk p2-4 s2) 35)
	(= (time-to-walk s4 p2-4) 22)
	(= (time-to-walk p2-4 s4) 22)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 11)
	(= (time-to-walk p3-0 s3) 11)
	(= (time-to-walk s0 p3-0) 10)
	(= (time-to-walk p3-0 s0) 10)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 30)
	(= (time-to-walk p3-4 s3) 30)
	(= (time-to-walk s4 p3-4) 13)
	(= (time-to-walk p3-4 s4) 13)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 11)
	(= (time-to-walk p0-2 s0) 11)
	(= (time-to-walk s2 p0-2) 16)
	(= (time-to-walk p0-2 s2) 16)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 16)
	(= (time-to-drive s0 s2) 16)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 31)
	(= (time-to-drive s1 s2) 31)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 18)
	(= (time-to-drive s3 s2) 18)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 28)
	(= (time-to-drive s0 s1) 28)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 21)
	(= (time-to-drive s3 s1) 21)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 38)
	(= (time-to-drive s4 s1) 38)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 38)
	(= (time-to-drive s2 s4) 38)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 9)
	(= (time-to-drive s3 s4) 9)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 7)
	(= (time-to-drive s3 s0) 7)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 22)
	(= (time-to-drive s4 s0) 22)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s0)
	(at truck1 s3)
	(at truck2 s3)
	(at package1 s0)
	(at package2 s1)
	(at package3 s2)
	(at package4 s0)
	(at package5 s1)
	(at package6 s2)
	(at package7 s3)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver4 truck1 s4)
   deleted: (at driver4 s4) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 11
2. (load-truck package5 truck1 s4)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 11
3. (drive-truck truck1 s4 s3 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (fuel-used) from 0 to 99
   goals met: 3 of 11
4. (load-truck package6 truck1 s3)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 11
5. (drive-truck truck1 s3 s1 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 99 to 372
   goals met: 2 of 11
6. (unload-truck package5 truck1 s1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 3 of 11
7. (drive-truck truck1 s1 s3 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 372 to 603
   goals met: 4 of 11
8. (walk driver1 s1 p4-1)
   deleted: (at driver1 s1)
   added: (at driver1 p4-1)
   goals met: 4 of 11
9. (walk driver1 p4-1 s4)
   deleted: (at driver1 p4-1)
   added: (at driver1 s4)
   goals met: 4 of 11
10. (board-truck driver1 truck2 s4)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 11
11. (drive-truck truck1 s3 s0 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 603 to 680
   goals met: 3 of 11
12. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 680 to 770
   goals met: 4 of 11
13. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 5 of 11
14. (load-truck package7 truck1 s0)
   deleted: (at package7 s0)
   added: (in package7 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 5 of 11
15. (drive-truck truck1 s0 s3 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 770 to 861
   goals met: 6 of 11
16. (unload-truck package7 truck1 s3)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 7 of 11
17. (drive-truck truck1 s3 s2 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 861 to 1059
   goals met: 6 of 11
18. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 11
19. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 7 of 11
20. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 7 of 11
21. (drive-truck truck1 s2 s0 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 1059 to 1267
   goals met: 7 of 11
22. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 8 of 11
23. (unload-truck package4 truck1 s0)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 9 of 11
24. (drive-truck truck1 s0 s3 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 1267 to 1337
   goals met: 10 of 11
25. (disembark-truck driver4 truck1 s3)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 10 of 11
26. (walk driver2 s1 p4-1)
   deleted: (at driver2 s1)
   added: (at driver2 p4-1)
   goals met: 10 of 11
27. (walk driver2 p4-1 s4)
   deleted: (at driver2 p4-1)
   added: (at driver2 s4)
   goals met: 10 of 11
28. (walk driver2 s4 p4-0)
   deleted: (at driver2 s4)
   added: (at driver2 p4-0)
   goals met: 10 of 11
29. (walk driver2 p4-0 s0)
   deleted: (at driver2 p4-0)
   added: (at driver2 s0)
   goals met: 11 of 11
